{
    "title": "Informaticien de Gestion HES",
    "header": {
        "phone": "Téléphone",
        "mail": "E-mail",
        "address": "Adresse",
        "references": "Références",
        "ondemand": "Sur demande",
        "lang": {
            "fr": "Français",
            "en": "Anglais"
        },
        "search_placeholder": "Rechercher ",
        "search_btn": "Rechercher",
        "rand": {
            "skill": "un skill",
            "comp": "une compétence",
            "talent": "un talent",
            "contact": "un contact",
            "experience": "une expérience",
            "achievement": "un accomplissement",
            "diploma": "un diplôme"
        }
    },
    "footer": {
        "app": "Ce CV est conçu avec "
    },
    "tab": {
        "personal_info": "Infos perso",
        "education": "Formation",
        "experience": "Expérience",
        "skills": "Compétences",
        "projects": "Projets",
        "interests": "Hobbies"
    },
    "personal_info": {
        "info": {
            "age": "Âge",
            "status": "Statut",
            "couple": "En couple",
            "driving_licence": "Permis de conduire",
            "cat_b": "Catégorie B",
            "years_old": "ans"
        },
        "contact": {
            "pro": "Pro",
            "games": "Gaming",
            "others": "Autres"
        },
        "who_am_i": {
            "title": "Qui suis-je ?",
            "general": "<strong>Bonjour ! Merci de prendre le temps de parcourir mon CV.</strong> Je m'appelle Julien et je suis Informaticien de Gestion. J'aime principalement le <strong>développement web</strong> et j'aime beaucoup travailler avec <strong>VueJs</strong> !",
            "college": "J'ai fait ma scolarité en Valais, notamment au <strong>Lycée-Collège des Creusets</strong> de Sion, en spécialisation Économie/Anglais. J'ai toujours beaucoup lu et aimé l'écriture, c'est pourquoi j'avais tout d'abord l'ambition de devenir <strong>journaliste</strong>. Après avoir fait quelques stages dans la profession, j'ai entamé une formation en <strong>Lettres à l'Université de Fribourg</strong> en 2012 avant de réaliser qu'il était extrêmement difficile de faire son trou dans ce milieu, déjà fortement éprouvé par l'émergence des nouveaux médias. J'ai donc décidé de changer de voie.",
            "hes": "J'ai travaillé à l'<strong>Hôpital de Sion</strong>, avant de recommencer mes études en 2016. En effet, ayant depuis toujours eu un fort attrait pour tout ce qui touche à l'<strong>informatique</strong>, j'ai décidé d'entreprendre les démarches pour m'inscrire au <strong>Bachelor en Informatique de Gestion de la HES de Sierre</strong>. J'ai obtenu mon diplôme en 2019 et je travaille maintenant aux <strong>instituts Tourisme et Informatique de Gestion</strong> de la HES-SO, en qualité d'<strong>Assistant de Recherche</strong>.",
            "next": "Apprendre étant pour moi toujours une source de motivation, j'ai pour objectif d'entamer un <strong>Master en Business Administration</strong> en automne 2021, à la HES de Lausanne. Je suis également à la recherche de petits projets à faire en dehors de mon travail. Si vous avez besoin d'un site web, n'hésitez pas à me <strong id='tooltip-contact'>contacter</strong> ;)"
        }
    },
    "education": {
        "diploms": "Diplômes",
        "udemy": "Formations Udemy",
        "maturity": {
            "title": "Maturité Gymnasiale",
            "location": "Lycée-Collège des Creusets (Sion)",
            "desc": "Options Économie & Anglais"
        },
        "bachelor": {
            "title": "Bachelor en Informatique de Gestion",
            "location": "HES-SO Valais/Wallis (Sierre)",
            "desc": "Axé <strong>Développement</strong> (principalement web) & <strong>Management</strong>. Agilité (SCRUM), Intégration continue, Testing, VCS, ... Plus d'infos sous la section Compétences."
        },
        "cisco": {
            "title": "Cisco CCNA",
            "location": "Haute École de Gestion (Genève)",
            "desc": "Routing & Switching (4 certifications), formation théorique et <strong>pratique</strong>. Cours optionnel sur une année (tous les samedis) dans le cadre de la HES."
        },
        "master": {
            "title": "Master en Management des Systèmes d'Information",
            "location": "HES-SO (Lausanne)",
            "desc": "Début programmé en 2021."
        },
        "vue_php": {
            "title": "Laravel and Vue.js - Fullstack Web Development (2020)",
            "desc": "Découverte du framework <strong>PHP Laravel</strong> (artisan, Blade, MVC, ...) pour le backend, en combinaison avec <strong>Vuejs</strong> (notion de components, axios, router, ...) pour le frontend."
        },
        "django_python": {
            "title": "Django & Python | Maitrisez le développement web",
            "desc": "Introduction aux principes du language <strong>Python</strong> et développement fullstack / déploiement avec le framework <strong>Django</strong>. Utilisation et paramétrisation de l'app <strong>Admin</strong> native de Django et création d'une app Blog, avec <strong>Bootstrap</strong>"
        },
        "react": {
            "title": "REACT 2020 par la pratique, de A à Z (évolution progressive)",
            "desc": "Introduction à la librairie <strong>React</strong> (state, axios, components vs containers, routing, ...) et création de 4 applications, en combinaison avec <strong>Bootstrap</strong>."
        },
        "r": {
            "title": "Apprendre la Data Science avec R",
            "desc": "Introduction au language <strong>R</strong> et aux librairies <strong>dplyr</strong> & <strong>ggplot2</strong>, pour la transformation et la visualisation de données."
        },
        "yii": {
            "title": "Learning Path: Yii 2: Design Applications with PHP",
            "desc": "Découverte du framework PHP <strong>Yii 2</strong>. Création d'une application fullstack."
        }
    },
    "skills": {
        "alert": "Les échelles données sont purement <strong>subjectives</strong> et représentent surtout mon expérience et mon intérêt dans les domaines en question !",
        "lang": {
            "fr": "Français",
            "de": "Allemand",
            "en": "Anglais",
            "mother": "Langue maternelle",
            "a1": "A1",
            "a2": "A2",
            "b1": "B1",
            "b2": "B2",
            "c1": "C1",
            "c2": "C2"
        },
        "coding": {
            "title": "Languages",
            "c#": "Asp.Net, EntityFramework & LinQ, API, ...",
            "r": "Data Scrambling with dplyr, Data Visualization with ggplot2",
            "sql": "MySQL, Microsoft SQL, PostgreSQL, SQLite, ..."
        },
        "frameworks": {
            "title": "Frameworks",
            "vuejs": "Nuxt, Vuetify, Axios, Store, Components vs Pages, ...",
            "reactjs": "Axios, State, Components vs Containers, ...",
            "shopify": "Avec Stripe, Checkout-X",
            "nodejs": "Express, Sequelize, PostgreSQL, AdonisJS"
        },
        "other_techs": {
            "title": "Autres compétences",
            "userexperience": "Garret's 5S Framework, interviews utilisateurs, design de frames, ...",
            "datavisualization": "Vega, Vega-Lite, Chartjs, Google Charts, R & ggplot2",
            "servermanagement": "Ubuntu avec Apache/nginx, Windows Server",
            "projectmanagement": "SCRUM Framework & Artifacts, Lean Management",
            "network": "Formation Cisco CCNA, Routing & Switching",
            "gis": "PostGIS, geoJson avec Leaflet, création de visualisations",
            "machinelearning": "Usage basique de Knime"
        },
        "soft_skills": {
            "title": "Soft Skills",
            "selfdevelopment": "Développement personnel",
            "positivecommunication": "Communication positive",
            "networking": "Networking",
            "fastlearner": "Facilité à apprendre",
            "teambuilding": "Team Building",
            "skillshare": "Partage de connaissance",
            "flexibility": "Flexibilité"
        }
    },
    "experiences": {
        "today": "aujourd'hui",
        "to": "à",
        "hes": {
            "title": "Assistant de Recherche - 100%",
            "location": "HES-SO Valais/Wallis, Sierre",
            "1": "Création & conception de sites webs, avec plusieurs langages et frameworks",
            "2": "Data scrambling et création de visualisations",
            "3": "Mise en place de serveurs web, déploiement de sites et applications",
            "4": "Aide à la rédaction d'articles scientifiques",
            "5": "Cours d'User eXperience aux classes de Bachelor"
        },
        "mhavie": {
            "title": "Plateforme Mhavie",
            "location": "IAT Lab, Sierre",
            "desc": "Projet de la HES, continué après mes études en marge de mon activité principale. Implémentation d'une méthode d'évaluation pour personnes en situation de handicap (plus d'info sous la section Projets).",
            "1": "Adaptation d'une solution existante aux besoins spécifiques de Mhavie",
            "2": "Implémentation des calculs pour le scoring",
            "3": "Conception d'un Dashboard administrateur et de visualisations, pour suivre l'évolution des personnes évaluées",
            "4": "Développement itératif, suivant les principes Agile"
        },
        "hopital_sion": {
            "title": "Collaborateur administratif - 100%",
            "location": "Hôpital Cantonal, Sion",
            "desc": "Poste occupé en vue de débuter mon Bachelor, qui avait pour condition un an d'expérience dans l'administration.",
            "1": "Préparation et archivage de dossiers médicaux",
            "2": "Rédaction de procès verbaux et diverses tâches administratives",
            "3": "Soutien à la cheffe de divison Gestion Médico-Économique"
        },
        "nouvelliste": {
            "title": "Journaliste stagiaire - 100%",
            "location": "Locaux du Nouvelliste, Sion",
            "1": "Rédaction en autonomie d'articles sur des événements locaux",
            "2": "Interviews de personnalités locales",
            "3": "Investigations menées seul, dans le cadre d'une enquête sur un corps diplomatique étranger"
        },
        "manor": {
            "title": "Hôte de caisse",
            "desc": "Aux rayons jouets & sport. À 100% aux Noëls 2012-2013, sinon à temps partiel",
            "location": "Manor, Sion",
            "1": "Acitivtés de caisse",
            "2": "Soutien à l'équipe de vente"
        }
    },
    "projects": {
        "title": "Quelques projets cools auxquels j'ai contribués",
        "subtitle": "Certaines plateformes sont malheureusement confidentielles, et donc inaccessibles.",
        "technologies": "Technologies",
        "mhavie": {
            "title": "Du formulaire papier à un système centralisé",
            "desc": "Mhavie est une méthodologie permettant de déterminer le <strong>niveau de réalisation de personnes en situation de handicap</strong>, selon leur âge. L'objectif est de quantifier les facultés des personnes évaluées dans différents domaines (social, culturel, professionnel, ...), en donnant également la possibilité d'indiquer un niveau de satisfaction. La combinaison de ces facteurs donne un score, qui permet d'assurer un <strong>suivi cohérent et bienveillant</strong> par le professionnel de santé, tout en gardant en vue des objectifs à long terme. Initialement sous la forme d'un fichier Excel et de formulaires papier, une plateforme web était devenue nécessaire pour conserver, agréger et visualiser les données.<br /><br />Mhavie a débuté comme projet d'étudiant; j'ai par la suite proposé au manager du projet, M. Julien Torrent d'IAT Lab, de poursuivre le développement de Mhavie après la deadline officielle. Après plusieurs itérations, le cahier des charges initial touchait au but et le produit a été livré aux clients."
        },
        "vasco": {
            "title": "Génération de graphiques & annotations : comment créer des connaissances en collaborant ?",
            "desc": "Mon <strong>premier projet</strong> en tant qu'Assistant de Recherche ! J'ai bénéficié d'une grande autonomie et d'une bonne marge de manoeuvre pour implémenter Vasco (pour Assisted <strong>V</strong>isualization Generation Platform for <strong>A</strong>nali<strong>s</strong>ing Data <strong>Co</strong>llaboratively). Le projet émane d'un travail de Master d'une étudiante de l'université de Fribourg. La plateforme poursuit deux objectifs : <strong>1)</strong> générer semi-automatiquement des graphiques à partir de jeux de données (Excel, csv, ...), pour que des utilisateurs peu expérimentés puissent visualiser leurs données sans connaissance approfondies d'outils tels que Tableau et <strong>2)</strong> d'annoter les graphiques produits en mettant en évidence certaines zones, pour stimuler la <strong>collaboration</strong> et éventuellement dégager des pistes d'analyse.<br /><br />Vasco est en ligne sur un serveur de la HES-SO (voir lien) et est parfois utilisé par notre équipe pour jeter un rapide coup d'oeil sur des données. Ses fonctionnalités vont notamment être reprises dans un <strong>projet d'imagerie médicale</strong>, en collaboration avec le CHUV."
        },
        "divoc": {
            "title": "SwissCovid avant l'heure",
            "desc": "diVoc prend ses origines dans un <strong>hackathon</strong> organisé par la HES-SO dans le cadre de la pandémie de covid-19. En effet, au vu des potentielles répercussions sanitaires et économiques du virus, l'école s'est immédiatement positionnée comme un acteur important, en proposant des solutions innovantes et en finançant des <strong>projets à court terme</strong>, comme diVoc.<br /><br />À l'instar de SwissCovid, l'application vise à détecter via le Bluetooth (Google Nearby) des rapprochements à risque entre des utilisateurs. Toutefois, diVoc propose en plus un système de <strong>gamification</strong> tout en garantissant la vie privée des utilisateurs. L'application est disponible sur le PlayStore de Google, mais son développement a été mis en stand-by par la release de SwissCovid."
        },
        "opoint": {
            "title": "Réseau social, rencontres, marché à l'emploi : un travail de Bachelor en faveur des personnes en situation de handicap",
            "desc": "Mon <strong>travail de Bachelor</strong>, en collaboration avec l'IAT Lab (le même Lab que pour le projet Mhavie). Visant tout d'abord à créer une sorte de 'Tinder' qui favoriserait les rencontres entre des personnes en situation de handicap. Après avoir recherché des solutions existantes et avoir déterminé un <strong>protocol d'interview</strong>, je suis allé au contact de potentiels futurs utilisateurs pour déterminer leurs réels besoins. A contrario des suppositions initiales, il s'est avéré que les besoins s'orientaient bien plus fortement vers une <strong>bourse à l'emploi</strong><br /><br />Ayant sélectionné ce travail dans le but de m'entrainer au développement web, j'ai finalement été poussé hors de ma zone de confort... pour mon plus grand bénéfice ! À la fois pour la dimension humaine, mais également pour les <strong>connaissances en design</strong> que j'ai acquises, O-Point m'a ouvert des perspectives professionnelles que je n'avais pas envisagées plus tôt dans mon cursus."
        },
        "tourobs": {
            "title": "Coup de jeune pour l'Observatoire du Tourisme",
            "desc": "Ayant décidé de rapatrier le site de l'Observatoire sur ses propres serveurs, l'Institut Tourisme m'a chargé de <strong>concevoir et développer le nouveau site</strong>. Destiné à du blogging et à servir de vitrine pour les dashboard développés par l'institut, le nouveau site poursuivait plusieurs objectifs : <strong>1)</strong> pouvoir réutiliser les articles déjà existants sur l'ancienne plateforme, <strong>2)</strong> satisfaire les standards UX tant pour la partie visiteur que pour la partie rédacteur et <strong>3)</strong> poser des bases saines pour la refonte de la partie 'data'.<br /><br />J'ai développé le site seul et l'ETL pour la compatibilité avec l'ancienne base de données seul, avec le <strong>CMS Umbraco</strong> et les outils de Visual Studio. Tourobs a pu faire peau neuve et la nouvelle interface a été saluée par l'équipe de l'Observatoire.<br /><br />J'ai également débuté la refonte du site <a href='https://data.tourobs.ch' target='_blank'>Data Tourobs</a>, en y incluant VueJs (ancienne version en ligne pour le moment). Retardé par la pandémie, le déploiement du nouveau Tourobs est prévu pour septembre 2020."
        },
        "radhy": {
            "title": "Premiers pas en GIS",
            "desc": "J'ai découvert le <strong>GIS et PostgreSQL</strong> avec le projet RADHY. Ne disposant que d'une quarantaine d'heures pour me former au GIS, mais aussi concevoir, développer et déployer la plateforme... C'était sportif ! Et pourtant, le projet RAHDY, en collaboration avec une équipe de chercheurs du sud-est de la France, s'avère prometteur. À partir des simulations générées par nos collègues français, je suis chargé de la visualisation des données pour mieux comprendre et anticiper les pénuries d'eau du bassin versant du Buech.<br /><br />Actuellement dans sa version 1.0, le développement de la plateforme RADHY devrait se poursuivre et être présentée à d'importants <strong>acteurs locaux</strong>, également confrontés à des enjeux hydrologiques."
        }
    },
    "interests": {
        "gaming": {
            "title": "Jeux vidéo",
            "desc": "Gamer depuis tout jeune, j'ai toujours été attiré par l'<strong>aspect compétitif</strong> des jeux vidéo. J'ai longtemps joué à haut niveau sur <strong>World of Warcraft</strong>, me plaçant même Top 2 mondial en Mythic+ à la saison 7.2, avant de me replier sur des jeux moins chronophages comme <strong>Counter Strike</strong>, <strong>Overwatch</strong>, <strong>Age of Empire II</strong>, <strong>Hearthstone</strong>... Je joue encore actuellement régulièrement à la plupart de ces jeux, lorsque j'ai du temps libre. Dans le même registre, je suis aussi un consommateur régulier de contenus <strong>Twitch</strong> ou <strong>Youtube</strong>."
        },
        "sport": {
            "title": "Sport",
            "desc": "J'ai fait partie dans mon adolescence du <strong>Cercle des Nageurs de Sion</strong>, et j'ai ensuite totalement arrêté le sport durant de nombreuses années. Après un véritable déclic, je me suis lancé intensivement dans la <strong>natation</strong> et le <strong>fitness</strong> durant environ 3 ans. À cause de mes études, j'ai du réduire la cadence. J'aime aussi explorer la Suisse en <strong>randonnée</strong>, <strong>accrobranche</strong> et autres activités de plein air."
        },
        "read": {
            "title": "Lecture & Culture",
            "desc": "Mon intérêt pour le journalisme n'est pas apparu par hasard. Durant mes trajets en train, j'ai longtemps eu pour habitude de lire des <strong>essais</strong> ou des <strong>romans fantastiques</strong>, ce qui a développé en moi un très fort intérêt pour la politique. J'aime me renseigner sur l'<strong>actualité</strong> et les débats houleux ! De nature curieuse, j'ai aussi tendance à m'intéresser à à peu près n'importe quel sujet : de la nutrition en passant par la biologie, j'adore me cultiver."
        }
    }
}